In [35]:
import pandas as pd #导入Pandas
import numpy as np
titanic_data = pd.read_csv('./titanic-data.csv')
titanic_data.head()#默认打印前五行

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [14]:
#打印年龄
age = titanic_data["Age"]
print(age.head())
print("*"*30)
print(age.loc[0:5])

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64
******************************
0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
Name: Age, dtype: float64

In [23]:
#判断值缺失,参数为想要判断的列
age_is_null = pd.isnull(age)
print(age_is_null.head())
#获取所有缺失值
age_null_true = age[age_is_null]
print(age_null_true.head())#比如age[False] 则不打印，这样就能筛选出所有的Nan值
#获取缺失值的个数
age_null_count = len(age_null_true)
print(age_null_count)

0    False
1    False
2    False
3    False
4    False
Name: Age, dtype: bool
5    NaN
17   NaN
19   NaN
26   NaN
28   NaN
Name: Age, dtype: float64
177

### 计算平均年龄

In [25]:
mean_age = sum(titanic_data["Age"])/len(titanic_data["Age"])
mean_age 
# 因为存在缺失值，所以计算结果为Nan

nan

In [31]:
good_ages = titanic_data["Age"][age_is_null == False]#age_is_null 如果是False则是没有缺失值的项
good_ages
current_mean_age = sum(good_ages)/len(good_ages)
print(current_mean_age)
#另一种算法
correct_mean_age = titanic_data["Age"].mean()#该方法也是对缺失值进行排除，得到的数据，会有很大误差，最好是用均值或众数对缺失值进行填充，然后在进行计算，这样误差会比较小
print(correct_mean_age)

29.69911764705882
29.69911764705882

In [38]:
#计算一二三等仓获救率   pivot_table 一个量和另一个量之间关系的函数；index 要比较的列，index跟某个值的关系，则values就为某个值
passenger_survival = titanic_data.pivot_table(index = "Pclass",values = "Survived",aggfunc=np.mean)